Autodesk.Revit.DB.SchedulableField.#ctor(Autodesk.Revit.DB.ScheduleFieldType,Autodesk.Revit.DB.ElementId)
Creates a new SchedulableField.
fieldType:
The type of data displayed by the field.
parameterId:
The ID of the parameter displayed by the field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldType is not a schedulable field type
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013